Model: "sequential_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_6 (Dense)              (None, 127)               508       
_________________________________________________________________
activation_4 (Activation)    (None, 127)               0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 127)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 127)               16256     
_________________________________________________________________
activation_5 (Activation)    (None, 127)               0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 127)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 1)                 128       
=================================================================
Total params: 16,892
Trainable params: 16,892
Non-trainable params: 0
