Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_3 (Dense)              (None, 127)               508       
_________________________________________________________________
activation_2 (Activation)    (None, 127)               0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 127)               0         
_________________________________________________________________
dense_4 (Dense)              (None, 127)               16256     
_________________________________________________________________
activation_3 (Activation)    (None, 127)               0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 127)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 1)                 128       
=================================================================
Total params: 16,892
Trainable params: 16,892
Non-trainable params: 0
