Model: "sequential"
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 127)               508       
_________________________________________________________________
activation (Activation)      (None, 127)               0         
_________________________________________________________________
dropout (Dropout)            (None, 127)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 127)               16256     
_________________________________________________________________
activation_1 (Activation)    (None, 127)               0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 127)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 128       
=================================================================
Total params: 16,892
Trainable params: 16,892
Non-trainable params: 0
